posts/examplary.org
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+OPTIONS: toc:nil

#+HUGO_BASE_DIR: /home/shane/var/smulliga/source/git/semiosis/semiosis-hugo
#+HUGO_SECTION: ./

#+TITLE: Examplary
#+DATE: <2021-03-17>
#+AUTHOR: Shane Mulligan
#+KEYWORDS: nlp openai

=Examplary= is an example-oriented DSL that can be used to construct and
compose functions based on prompts and external =String->String= commands.

Using examplary, one can keep track of their various =String->String= functions
but also:
- generate prompts from an example generator

Here are some examples:

#+BEGIN_SRC clojure -n :i clj :async :results verbatim code
  (def regex
    "example 1\nexample2" "^example [12]$"
    "example 2\nexample3" "^example [23]$"
    "pi4\npi5" "^pi[45]$")
  
  (def analogy
    ;; Each line is a training example.
    "Neural networks" "Neural networks are like genetic algorithms in that both are systems that learn from experience"
    "Social media" "Social media is like a market in that both are systems that coordinate the actions of many individuals.")
  
  (def field
    "chemistry" "study of chemicals"
    "biology" "study of living things")
#+END_SRC

*** Related links
- Code: http://github.com/semiosis/examplary

# + Website :: [[http://mullikine.github.io/][Bodacious Blog]]
# + GitHub :: https://github.com/IpsumDominum